avr-rust/avrd/packs/atmega/AT90PWM2B.atdf
    <module caption="Watchdog Timer" name="WDT">
      <register-group caption="Watchdog Timer" name="WDT">
        <register caption="Watchdog Timer Control Register" name="WDTCSR" offset="0x60" size="1" ocd-rw="R">
          <bitfield caption="Watchdog Timeout Interrupt Flag" mask="0x80" name="WDIF"/>
          <bitfield caption="Watchdog Timeout Interrupt Enable" mask="0x40" name="WDIE"/>
          <bitfield caption="Watchdog Timer Prescaler Bits" mask="0x27" name="WDP" values="WDOG_TIMER_PRESCALE_4BITS"/>
          <bitfield caption="Watchdog Change Enable" mask="0x10" name="WDCE"/>
          <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
        </register>
      </register-group>
      <value-group caption="" name="WDOG_TIMER_PRESCALE_4BITS">
        <value caption="Oscillator Cycles 2K" name="VAL_0x00" value="0x00"/>
        <value caption="Oscillator Cycles 4K" name="VAL_0x01" value="0x01"/>
        <value caption="Oscillator Cycles 8K" name="VAL_0x02" value="0x02"/>
        <value caption="Oscillator Cycles 16K" name="VAL_0x03" value="0x03"/>
        <value caption="Oscillator Cycles 32K" name="VAL_0x04" value="0x04"/>
        <value caption="Oscillator Cycles 64K" name="VAL_0x05" value="0x05"/>
        <value caption="Oscillator Cycles 128K" name="VAL_0x06" value="0x06"/>
        <value caption="Oscillator Cycles 256K" name="VAL_0x07" value="0x07"/>
        <value caption="Oscillator Cycles 512K" name="VAL_0x08" value="0x08"/>
        <value caption="Oscillator Cycles 1024K" name="VAL_0x09" value="0x09"/>
      </value-group>
    </module>
    <module caption="External Interrupts" name="EXINT">
      <register-group caption="External Interrupts" name="EXINT">
        <register caption="External Interrupt Control Register A" name="EICRA" offset="0x69" size="1">
          <bitfield caption="External Interrupt Sense Control Bit" mask="0xC0" name="ISC3" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt Sense Control Bit" mask="0x30" name="ISC2" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt Sense Control Bit" mask="0x0C" name="ISC1" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt Sense Control Bit" mask="0x03" name="ISC0" values="INTERRUPT_SENSE_CONTROL"/>
        </register>
        <register caption="External Interrupt Mask Register" name="EIMSK" offset="0x3D" size="1">
          <bitfield caption="External Interrupt Request Enable" mask="0x07" name="INT"/>
        </register>
        <register caption="External Interrupt Flag Register" name="EIFR" offset="0x3C" size="1" ocd-rw="R">
          <bitfield caption="External Interrupt Flags" mask="0x07" name="INTF"/>
        </register>
      </register-group>
      <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
        <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
        <value caption="Any Logical Change of INTX" name="VAL_0x01" value="0x01"/>
        <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
        <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="EEPROM" name="EEPROM">
      <register-group caption="EEPROM" name="EEPROM">
        <register caption="EEPROM Read/Write Access Bytes" name="EEAR" offset="0x41" size="2" mask="0x0FFF">
          <bitfield caption="EEPROM Address bytes" mask="0x0FFF" name="EEAR"/>
        </register>
        <register caption="EEPROM Data Register" name="EEDR" offset="0x40" size="1">
          <bitfield caption="EEPROM Data Bits" mask="0xFF" name="EEDR"/>
        </register>
        <register caption="EEPROM Control Register" name="EECR" offset="0x3F" size="1">
          <bitfield caption="EEPROM Programming Mode" mask="0x30" name="EEPM"/>
          <bitfield caption="EEPROM Ready Interrupt Enable" mask="0x08" name="EERIE"/>
          <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMWE"/>
          <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEWE"/>
          <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
        </register>
      </register-group>
    </module>
    <module caption="Power Stage Controller" name="PSC">
      <register-group caption="Power Stage Controller" name="PSC0">
        <register caption="PSC 0 Input Capture Register " name="PICR0" offset="0xDE" size="2" mask="0x8FFF">
          <bitfield caption="PSC 0 Input Capture Software Trig" mask="0x8000" name="PCST0"/>
          <bitfield caption="PSC 0 Input Capture Bytes" mask="0x0FFF" name="PICR0"/>
        </register>
        <register caption="PSC 0 Input B Control" name="PFRC0B" offset="0xDD" size="1">
          <bitfield caption="PSC 0 Capture Enable Input Part B" mask="0x80" name="PCAE0B"/>
          <bitfield caption="PSC 0 Input Select for Part B" mask="0x40" name="PISEL0B"/>
          <bitfield caption="PSC 0 Edge Level Selector on Input Part B" mask="0x20" name="PELEV0B"/>
          <bitfield caption="PSC 0 Filter Enable on Input Part B" mask="0x10" name="PFLTE0B"/>
          <bitfield caption="PSC 0 Retrigger and Fault Mode for Part B" mask="0x0F" name="PRFM0B"/>
        </register>
        <register caption="PSC 0 Input A Control" name="PFRC0A" offset="0xDC" size="1">
          <bitfield caption="PSC 0 Capture Enable Input Part A" mask="0x80" name="PCAE0A"/>
          <bitfield caption="PSC 0 Input Select for Part A" mask="0x40" name="PISEL0A"/>
          <bitfield caption="PSC 0 Edge Level Selector on Input Part A" mask="0x20" name="PELEV0A"/>
          <bitfield caption="PSC 0 Filter Enable on Input Part A" mask="0x10" name="PFLTE0A"/>
          <bitfield caption="PSC 0 Retrigger and Fault Mode for Part A" mask="0x0F" name="PRFM0A"/>
        </register>
        <register caption="PSC 0 Control Register" name="PCTL0" offset="0xDB" size="1">
          <bitfield caption="PSC 0 Prescaler Selects" mask="0xC0" name="PPRE0"/>
          <bitfield caption="PSC 0 Balance Flank Width Modulation" mask="0x20" name="PBFM0"/>
          <bitfield caption="PSC 0 Asynchronous Output Control B" mask="0x10" name="PAOC0B"/>
          <bitfield caption="PSC 0 Asynchronous Output Control A" mask="0x08" name="PAOC0A"/>
          <bitfield caption="PSC0 Auto Run" mask="0x04" name="PARUN0"/>
          <bitfield caption="PSC0 Complete Cycle" mask="0x02" name="PCCYC0"/>
          <bitfield caption="PSC 0 Run" mask="0x01" name="PRUN0"/>
        </register>
        <register caption="PSC 0 Configuration Register" name="PCNF0" offset="0xDA" size="1">
          <bitfield caption="PSC 0 Fifty" mask="0x80" name="PFIFTY0"/>
          <bitfield caption="PSC 0 Autolock" mask="0x40" name="PALOCK0"/>
          <bitfield caption="PSC 0 Lock" mask="0x20" name="PLOCK0"/>
          <bitfield caption="PSC 0 Mode" mask="0x18" name="PMODE0"/>
          <bitfield caption="PSC 0 Output Polarity" mask="0x04" name="POP0"/>
          <bitfield caption="PSC 0 Input Clock Select" mask="0x02" name="PCLKSEL0"/>
        </register>
